app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:nome).page(params[:page]).per(10)
---
SELECT  "contacts".* FROM "contacts"   ORDER BY "contacts"."nome" ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "contacts"

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("created_at", "email", "kind_id", "nome", "rmk", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-03-09 13:23:17.922472"], ["email", "Rodolfo_dolfo"], ["kind_id", 4], ["nome", "Rodolfo"], ["rmk", "Roupas"], ["updated_at", "2018-03-09 13:23:17.922472"]]

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "kind_id" = ?, "updated_at" = ? WHERE "contacts"."id" = 3  [["kind_id", 1], ["updated_at", "2018-03-09 13:27:04.802465"]]

    def set_options_for_select
      @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"