app/controllers/kinds_controller.rb

  def index # nome do arquivome
    @nome = "Lucas Correia"
    @kinds = Kind.all # SELECT "kinds".* FROM "kinds"
---
SELECT "kinds".* FROM "kinds"

  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("created_at", "description", "updated_at") VALUES (?, ?, ?)  [["created_at", "2018-03-08 02:46:54.478106"], ["description", "Amigo"], ["updated_at", "2018-03-08 02:46:54.478106"]]

  def destroy
    @kind.destroy
---
DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 5]]

    def set_kind
      @kind = Kind.find(params[:id])
---
SELECT  "kinds".* FROM "kinds"  WHERE "kinds"."id" = ? LIMIT 1  [["id", 5]]